Tekla Open API Reference for Tekla Structures 2025
GridSurface Properties
The GridSurface type exposes the following members.
Properties
Name | Description
DrawingVisibility
 The visibility of the grid surface in drawings.
ExtensionAbove
 The line extension above.
ExtensionBelow
 The line extension below.
ExtensionLeft
 The line extension on the left.
ExtensionRight
 The line extension on the right.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsMagnetic
 Whether the grid surface is magnetic or not.
IsManual
 Gets or sets if the line was manually created.
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
Label
 The label for the grid surface.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Parent
 The parent grid of the grid surface.
Top
See Also
Reference
GridSurface Class
Tekla.Structures.Model Namespace